STMicroelectronics/STM32CubeWB/Drivers/BSP/Components/ism330dhcx/ism330dhcx_reg.h
int32_t ism330dhcx_fsm_out_get(stmdev_ctx_t *ctx,
                               ism330dhcx_fsm_out_t *val);

typedef enum
{
  ISM330DHCX_ODR_FSM_12Hz5 = 0,
  ISM330DHCX_ODR_FSM_26Hz  = 1,
  ISM330DHCX_ODR_FSM_52Hz  = 2,
  ISM330DHCX_ODR_FSM_104Hz = 3,
} ism330dhcx_fsm_odr_t;
int32_t ism330dhcx_fsm_data_rate_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_fsm_odr_t val);
int32_t ism330dhcx_fsm_data_rate_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_fsm_odr_t *val);

int32_t ism330dhcx_fsm_init_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_fsm_init_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_long_cnt_int_value_set(stmdev_ctx_t *ctx,
                                          uint16_t val);
int32_t ism330dhcx_long_cnt_int_value_get(stmdev_ctx_t *ctx,
                                          uint16_t *val);

int32_t ism330dhcx_fsm_number_of_programs_set(stmdev_ctx_t *ctx,
                                              uint8_t *buff);
int32_t ism330dhcx_fsm_number_of_programs_get(stmdev_ctx_t *ctx,
                                              uint8_t *buff);

int32_t ism330dhcx_fsm_start_address_set(stmdev_ctx_t *ctx,
                                         uint16_t val);
int32_t ism330dhcx_fsm_start_address_get(stmdev_ctx_t *ctx,
                                         uint16_t *val);

int32_t ism330dhcx_mlc_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_mlc_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_mlc_status_get(stmdev_ctx_t *ctx,
                                  ism330dhcx_mlc_status_mainpage_t *val);

typedef enum
{
  ISM330DHCX_ODR_PRGS_12Hz5 = 0,
  ISM330DHCX_ODR_PRGS_26Hz  = 1,
  ISM330DHCX_ODR_PRGS_52Hz  = 2,
  ISM330DHCX_ODR_PRGS_104Hz = 3,
} ism330dhcx_mlc_odr_t;
int32_t ism330dhcx_mlc_data_rate_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_mlc_odr_t val);
int32_t ism330dhcx_mlc_data_rate_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_mlc_odr_t *val);

typedef struct
{
  ism330dhcx_sensor_hub_1_t   sh_byte_1;
  ism330dhcx_sensor_hub_2_t   sh_byte_2;
  ism330dhcx_sensor_hub_3_t   sh_byte_3;
  ism330dhcx_sensor_hub_4_t   sh_byte_4;
  ism330dhcx_sensor_hub_5_t   sh_byte_5;
  ism330dhcx_sensor_hub_6_t   sh_byte_6;
  ism330dhcx_sensor_hub_7_t   sh_byte_7;
  ism330dhcx_sensor_hub_8_t   sh_byte_8;
  ism330dhcx_sensor_hub_9_t   sh_byte_9;
  ism330dhcx_sensor_hub_10_t  sh_byte_10;
  ism330dhcx_sensor_hub_11_t  sh_byte_11;
  ism330dhcx_sensor_hub_12_t  sh_byte_12;
  ism330dhcx_sensor_hub_13_t  sh_byte_13;
  ism330dhcx_sensor_hub_14_t  sh_byte_14;
  ism330dhcx_sensor_hub_15_t  sh_byte_15;
  ism330dhcx_sensor_hub_16_t  sh_byte_16;
  ism330dhcx_sensor_hub_17_t  sh_byte_17;
  ism330dhcx_sensor_hub_18_t  sh_byte_18;
} ism330dhcx_emb_sh_read_t;
int32_t ism330dhcx_sh_read_data_raw_get(stmdev_ctx_t *ctx,
                                        ism330dhcx_emb_sh_read_t *val,
                                        uint8_t len);

typedef enum
{
  ISM330DHCX_SLV_0       = 0,
  ISM330DHCX_SLV_0_1     = 1,
  ISM330DHCX_SLV_0_1_2   = 2,
  ISM330DHCX_SLV_0_1_2_3 = 3,
} ism330dhcx_aux_sens_on_t;
int32_t ism330dhcx_sh_slave_connected_set(stmdev_ctx_t *ctx,
                                          ism330dhcx_aux_sens_on_t val);
int32_t ism330dhcx_sh_slave_connected_get(stmdev_ctx_t *ctx,
                                          ism330dhcx_aux_sens_on_t *val);

int32_t ism330dhcx_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_EXT_PULL_UP      = 0,
  ISM330DHCX_INTERNAL_PULL_UP = 1,
} ism330dhcx_shub_pu_en_t;
int32_t ism330dhcx_sh_pin_mode_set(stmdev_ctx_t *ctx,
                                   ism330dhcx_shub_pu_en_t val);
int32_t ism330dhcx_sh_pin_mode_get(stmdev_ctx_t *ctx,
                                   ism330dhcx_shub_pu_en_t *val);

int32_t ism330dhcx_sh_pass_through_set(stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t ism330dhcx_sh_pass_through_get(stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  ISM330DHCX_EXT_ON_INT2_PIN = 1,
  ISM330DHCX_XL_GY_DRDY      = 0,
} ism330dhcx_start_config_t;
int32_t ism330dhcx_sh_syncro_mode_set(stmdev_ctx_t *ctx,
                                      ism330dhcx_start_config_t val);
int32_t ism330dhcx_sh_syncro_mode_get(stmdev_ctx_t *ctx,
                                      ism330dhcx_start_config_t *val);

typedef enum
{
  ISM330DHCX_EACH_SH_CYCLE    = 0,
  ISM330DHCX_ONLY_FIRST_CYCLE = 1,
} ism330dhcx_write_once_t;
int32_t ism330dhcx_sh_write_mode_set(stmdev_ctx_t *ctx,
                                     ism330dhcx_write_once_t val);
int32_t ism330dhcx_sh_write_mode_get(stmdev_ctx_t *ctx,
                                     ism330dhcx_write_once_t *val);

int32_t ism330dhcx_sh_reset_set(stmdev_ctx_t *ctx);
int32_t ism330dhcx_sh_reset_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  ISM330DHCX_SH_ODR_104Hz = 0,
  ISM330DHCX_SH_ODR_52Hz  = 1,
  ISM330DHCX_SH_ODR_26Hz  = 2,
  ISM330DHCX_SH_ODR_13Hz  = 3,
} ism330dhcx_shub_odr_t;
int32_t ism330dhcx_sh_data_rate_set(stmdev_ctx_t *ctx,
                                    ism330dhcx_shub_odr_t val);
int32_t ism330dhcx_sh_data_rate_get(stmdev_ctx_t *ctx,
                                    ism330dhcx_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} ism330dhcx_sh_cfg_write_t;
int32_t ism330dhcx_sh_cfg_write(stmdev_ctx_t *ctx,
                                ism330dhcx_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} ism330dhcx_sh_cfg_read_t;
int32_t ism330dhcx_sh_slv0_cfg_read(stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv1_cfg_read(stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv2_cfg_read(stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);
int32_t ism330dhcx_sh_slv3_cfg_read(stmdev_ctx_t *ctx,
                                    ism330dhcx_sh_cfg_read_t *val);

int32_t ism330dhcx_sh_status_get(stmdev_ctx_t *ctx,
                                 ism330dhcx_status_master_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* ISM330DHCX_REGS_H */
